# 중첩 리스트

#3x3 2차원 행렬을 중첩리스트로 선언
city = [
    ['서울',  '도쿄',  '베이징'],
    ['런던',  '파리',  '로마'  ],
    ['워싱턴','시카고','잭슨빌']
]

print('city     :', city)
print('city[0]  :', city[0])        #['서울', '도쿄', '베이징'] 값 출력.
print('city[1]  :', city[1])
print('city[-1] :', city[-1])
print('city[0][0]:', city[0][0])
print('city[0][1]:', city[0][1])
print('city[0][2]:', city[0][2])
print('city[1][2]:', city[1][2])
print('city[2][0]:', city[2][0])

    # city     : [['서울', '도쿄', '베이징'], ['런던', '파리', '로마'], ['워싱턴', '시카고', '잭슨빌']]
    # city[0]  : ['서울', '도쿄', '베이징']
    # city[1]  : ['런던', '파리', '로마']
    # city[-1] : ['워싱턴', '시카고', '잭슨빌']
    # city[0][0]: 서울
    # city[0][1]: 도쿄
    # city[0][2]: 베이징
    # city[1][2]: 로마
    # city[2][0]: 워싱턴
